# -*- coding: utf-8 -*-
"""
Created on Sat Sep  7 13:09:43 2019

@author: Xandr
"""

#Бібліотека datetime використовується для роботи в Python з часом і датами, 
#дозволяючи представляти дану інформацію в найбільш зручній формі.

#На відміну від модуля time, в datetime є кілька вбудованих класів, 
#що дозволяють виробляти різні маніпуляції з датою і часом, 
#такі як арифметичні операції або порівняння.

"""date

Клас date використовується для представлення даних про дату, 
які включають рік, місяць і число. Щоб мати можливість застосовувати цей клас, 
необхідно попередньо імпортувати модуль datetime, 
помістивши відповідну інструкцію в початок файлу з програмним кодом. 
Для створення об'єктів типу date слід зробити виклик однойменного конструктора, 
вказавши йому в якості параметрів відомості про дату. 
При цьому не можна забувати про порядок, в якому знаходяться аргументи: 
рік, потім місяць і число."""

import datetime
a = datetime.date(2019, 12, 28)
print(a)

a = datetime.date.today()
print(a)

print("Year :", a.year)
print("Month :",a.month)
print("Day :",a.day)