# -*- coding: utf-8 -*-
"""
Created on Sat Sep  7 13:40:32 2019

@author: Xandr
"""
"""
Операції із датою

a + b -- підсумовує значення дат a і b
a - b -- знаходить різницю між датами a і b
a * i -- примножує чисельне представлення властивостей дати a на якусь константу i
a // i -- ділить чисельне представлення властивостей дати a на якусь константу i, 
          залишок відкидається
+a -- повертає об'єкт timedelta з повністю ідентичним значенням a
-a -- повертає об'єкт timedelta з повністю протилежним значенням a
a > b -- повертає true, якщо a більше b
a < b -- повертає true, якщо a менше b
abs(a) -- повертає об'єкт timedelta з позитивним значенням всіх властивостей a
str(a) -- повертає строкове представлення об'єкту a в форматі, заданому за 
          замовчуванням
repr(a) --  повертає строкове представлення об'єкту a в форматі 
            з негативними значеннями
"""

import datetime
a = datetime.datetime.now()
b = datetime.datetime(2018, 3, 21)
c = a - b
print(c)